fonecmid-diplom/src/Documents/BKM_ОбслуживаниеКлиентов/BKM_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>InformationRegister.ВКМ_ЗаписиЗадач</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПовтор</name>
    <comment>Для расписания</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеРасписания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ВКМ_СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ВКМ_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВКМ_КатегорииЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаПовторов</name>
    <attributes>
      <name>ДатаПовтора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удаленный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗамещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаЗамещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияЗамещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/BKM_ОбслуживаниеКлиентов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
//{{MRG[ <-> ]
//	Оповестить("Обновить данные планировщика");
//}}MRG[ <-> ]
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
//{{MRG[ <-> ]
//	Расписание = ТекущийОбъект.ДанныеРасписания.Получить();
//}}MRG[ <-> ]
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//{{MRG[ <-> ]
//	ПодставитьЦветКатегории(); 
//}}MRG[ <-> ]
	
//{{MRG[ <-> ]
//	// Если документ открывается администратором, поле Пользователь отобразится
//	Если ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.Администратор Тогда
//		Элементы.Пользователь.Видимость = Истина;
//	КонецЕсли; 
//}}MRG[ <-> ]
	
//{{MRG[ <-> ]
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	//Надпись в новый документ
//	Если Расписание = Неопределено Тогда
//		Расписание = "Настроить расписание...";
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Иначе
//}}MRG[ <-> ]
	// СтандартныеПодсистемы.РаботаСФайлами
//{{MRG[ <-> ]
	ГиперссылкаФайлов = РаботаСФайлами.ГиперссылкаФайлов();
	ГиперссылкаФайлов.Размещение = "КоманднаяПанель";
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Элементы.ТаблицаПовторов.Видимость = Истина;
//		Элементы.Дата.Видимость = Ложь;
//	КонецЕсли;	
//}}MRG[ <-> ]
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    
	    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Если в карточке категории меняется цвет, то на форме документа будет переподставляться цвет
	Если ИмяСобытия = "ИзменениеЦветаКатегории" Тогда
		ПодставитьЦветКатегории();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	Если ТипЗнч(Расписание) = Тип("РасписаниеЭлементаПланировщика") Тогда
		ТекущийОбъект.ДанныеРасписания = Новый ХранилищеЗначения(Расписание);
	// Или не передаем данных вовсе	
	Иначе
		ТекущийОбъект.ДанныеРасписания = Неопределено;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти 


#Область ОбработчикиСобытийЭлементовШапкиФормы 
 
 &НаКлиенте
 Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	 
	 ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект);
	 
 КонецПроцедуры 
 
&НаКлиенте
Процедура ОписаниеПроблемыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.ОписаниеПроблемы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции   

#Область РаботаСФайлами

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
// СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти
 

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьИзмененияВТелеграммНаСервере()
	ВКМ_ТелграммБот.ОтправитьУведомленияВТелеграмм();// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьИзмененияВТелеграмм(Команда)
	ОтправитьИзмененияВТелеграммНаСервере();
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

// Подставка цвета соответсвующей задачи
&НаСервере
Процедура ПодставитьЦветКатегории()
	ЭтотОбъект.Цвет = Объект.Категория.Цвет.Получить();
КонецПроцедуры 

// Открытие расписания планировщика и сохранение информации в реквизит формы произвольного типа 
&НаКлиенте
Процедура НастройкаНовогоРасписанияВДиалоге()
	// Сравниваем реквизит формы со встроенным расписанием планировщика
	НаличиеРасписания = (ТипЗнч(Расписание) = Тип("РасписаниеЭлементаПланировщика"));
	// При наличии такого расписание, открываем его, иначе создаем новое
	РасписаниеДляДиалога = ?(НаличиеРасписания, Расписание, Новый РасписаниеЭлементаПланировщика);
	// Используем полученное выше расписание для создания диалога настройки расписания
	ДиалогРасписания = Новый ДиалогРасписанияЭлементаПланировщика(РасписаниеДляДиалога);
	ОписаниеОповещенияРасписание = Новый ОписаниеОповещения("ОбработкаРасписания", ЭтотОбъект, НаличиеРасписания);
	// Открываем диалог расписания для ожидания и обработки ответа пользователя
	ДиалогРасписания.Показать(ОписаниеОповещенияРасписание);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРасписания(НовоеРасписание, НаличиеРасписания) Экспорт
	// Сохраняем расписание и меняем данные формы
	Если НовоеРасписание <> Неопределено Тогда
			Если НЕ ПроверкаЗаполненияРасписания(НовоеРасписание) Тогда
			НастройкаНовогоРасписанияВДиалоге();
			Возврат;
		КонецЕсли;
		Расписание = НовоеРасписание;  
		ЗаполнениеТаблицыПовторов(НовоеРасписание);
		Объект.ЕстьПовтор = Истина;
		Элементы.ТаблицаПовторов.Видимость = Истина; 
		Элементы.Дата.Видимость = Ложь;
   		Модифицированность = Истина;
	// Убираем повторы, если расписания нет
	ИначеЕсли НЕ НаличиеРасписания Тогда
		Объект.ЕстьПовтор = Ложь;
	КонецЕсли;	

КонецПроцедуры 

&НаКлиенте
Функция ПроверкаЗаполненияРасписания(НовоеРасписание)
	ОчиститьСообщения();
	Результат = Истина;
	Если НовоеРасписание.КоличествоПовторов = 0 И НовоеРасписание.ДатаКонца = Дата(1,1,1) Тогда
		Сообщить("Нужно заполнить хотя бы одно из полей:" + Символы.ПС + """Повторять до"" или ""Число повторов""");
		Результат = Ложь;
	КонецЕсли;
	
	Если 
		// Проверка заполнения полей "Повторять каждые:"	
		НовоеРасписание.ПериодЛет = 0 И
		НовоеРасписание.ПериодМесяцев = 0 И
		НовоеРасписание.ПериодНедель = 0 И
		НовоеРасписание.ПериодПовтораДней = 0
		Тогда
		Сообщить("Хотя бы в одном поле ""Повторять каждые:"" должно быть ненулевое значение.");
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
 
&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	ПодставитьЦветКатегории();
КонецПроцедуры 

&НаКлиенте
АСИНХ Процедура ЕстьПовторПриИзмененииАсинх(Элемент)
	//Открываем диалог расписание, если выбраны повторы	
	Если Объект.ЕстьПовтор Тогда
		НастройкаНовогоРасписанияВДиалоге(); 
		//Если галочка убирается, то удаляем расписание повторов
	Иначе
		//Уточним у пользователя, хочет ли он удалить
		Ответ = ЖДАТЬ ВопросАсинх("Вы уверены, что хотите удалить расписание повторов?" + Символы.ПС + "Таблица повторов будет очищена.",
		РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Удаление расписания");
		// Очищаем и скрываем таблицу повторов
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.ТаблицаПовторов.Очистить();
			Элементы.ТаблицаПовторов.Видимость = Ложь;
			Элементы.Дата.Видимость = Истина; 
			// Вместо расписания - строка
			Расписание = "Настроить расписание...";
		// При нажатии Нет или Крест удаление не срабатывает
		Иначе	
			Объект.ЕстьПовтор = Истина;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура РасписаниеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НастройкаНовогоРасписанияВДиалоге();
КонецПроцедуры

#Область ОбработчикиСобытийТаблицыФормы
&НаКлиенте
Процедура ТаблицаПовторовДатаЗамещенияПриИзменении(Элемент)
	
	Строка = Элементы.ТаблицаПовторов.ТекущиеДанные;
	// Дата	
	Если ЗначениеЗаполнено(Строка.ДатаЗамещения) Тогда
		// НЕ Начало + НЕ Конец 
		Если 
			НЕ ЗначениеЗаполнено(Строка.ВремяНачалаЗамещения) И
			НЕ ЗначениеЗаполнено(Строка.ВремяОкончанияЗамещения) Тогда
			Строка.ВремяНачалаЗамещения = Объект.ВремяНачалаПлан;
			Строка.ВремяОкончанияЗамещения = Объект.ВремяОкончанияПлан;
		КонецЕсли;
		// НЕ Дата + Начало + Конец 
	Иначе 		
		Строка.ВремяНачалаЗамещения = Дата(1,1,1);
		Строка.ВремяОкончанияЗамещения = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПовторовВремяНачалаЗамещенияПриИзменении(Элемент)
	
	Строка = Элементы.ТаблицаПовторов.ТекущиеДанные;
	// Начало 
	Если ЗначениеЗаполнено(Строка.ВремяНачалаЗамещения) Тогда
		// НЕ Дата + НЕ Конец 
		Если
			НЕ ЗначениеЗаполнено(Строка.ДатаЗамещения) И
			НЕ ЗначениеЗаполнено(Строка.ВремяОкончанияЗамещения) Тогда
			
			Строка.ДатаЗамещения = Строка.ДатаПовтора;
			ВремяОкончания = Строка.ВремяНачалаЗамещения + (Объект.ВремяОкончанияПлан - Объект.ВремяНачалаПлан);
			Строка.ВремяОкончанияЗамещения = ?(ВремяОкончания < Дата(1,1,2), ВремяОкончания, Дата(1,1,1, 23,59,59)); 
		КонецЕсли;
		// НЕ Начало + Дата + Конец 
	Иначе
		Строка.ДатаЗамещения = Дата(1,1,1);
		Строка.ВремяОкончанияЗамещения = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПовторовВремяОкончанияЗамещенияПриИзменении(Элемент)
	
	Строка = Элементы.ТаблицаПовторов.ТекущиеДанные;
	// Конец 
	Если ЗначениеЗаполнено(Строка.ВремяОкончанияЗамещения) Тогда
		// НЕ Начало + НЕ Конец 
		Если 
			НЕ ЗначениеЗаполнено(Строка.ВремяНачалаЗамещения) И
			НЕ ЗначениеЗаполнено(Строка.ДатаЗамещения) Тогда
			Строка.ДатаЗамещения = Строка.ДатаПовтора;
			Строка.ВремяНачалаЗамещения = Строка.ВремяОкончанияЗамещения - (Объект.ВремяОкончанияПлан - Объект.ВремяНачалаПлан); 
		КонецЕсли;
		// НЕ Конец + Начало + Конец 	
	Иначе
		Строка.ДатаЗамещения = Дата(1,1,1);
		Строка.ВремяНачалаЗамещения = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПовторовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ОчиститьСообщения();
	
	Строка = Элемент.ТекущиеДанные;
	
	Если Строка.ВремяНачалаЗамещения >= Строка.ВремяОкончанияЗамещения И ЗначениеЗаполнено(Строка.ДатаЗамещения) Тогда
		Сообщить("Повтор задачи не может начинаться во время окончания или позднее него.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗаполнениеТаблицыПовторов

&НаКлиенте
Процедура ЗаполнениеТаблицыПовторов(НовоеРасписание)
	
	Объект.ТаблицаПовторов.Очистить();
	// "Повторять каждые:" - 1 (не заполнено), иначе от пользователя		
	ПериодПовтораДней = ?(НовоеРасписание.ПериодПовтораДней = 0, 1, НовоеРасписание.ПериодПовтораДней);
	ПериодНедель = ?(НовоеРасписание.ПериодНедель = 0, 1, НовоеРасписание.ПериодНедель);
	ПериодМесяцев = ?(НовоеРасписание.ПериодМесяцев = 0, 1, НовоеРасписание.ПериодМесяцев);
	ПериодЛет = ?(НовоеРасписание.ПериодЛет = 0, 1, НовоеРасписание.ПериодЛет); 
	
	Если НовоеРасписание.ДниНедели.Количество() = 0 Тогда
		 ДниНедели = Новый Массив;
		 Для НомерДняНедели = 1 По 7 Цикл
		 	ДниНедели.Добавить(НомерДняНедели);	
		КонецЦикла;
	Иначе
		ДниНедели = НовоеРасписание.ДниНедели;
	КонецЕсли;

	Если НовоеРасписание.Месяцы.Количество() = 0 Тогда
		Месяцы = Новый Массив;
		Для НомерМесяцаВГоду = 1 По 12 Цикл
			Месяцы.Добавить(НомерМесяцаВГоду);
		КонецЦикла;
	Иначе
		Месяцы = НовоеРасписание.Месяцы;
	КонецЕсли;
	ДатаИтерации = Объект.Дата;
	КоличествоПовторов = 0;
	
	ПредыдущаяРазницаВНеделях = -1;
	ПредыдущаяРазницаВМесяцах = -1;
	ПредыдущаяРазницаВГодах = -1;
	// Пользователь указал количество повторов или дату конца
	Пока (НовоеРасписание.ДатаКонца = Дата(1,1,1) ИЛИ НовоеРасписание.ДатаКонца <> ДатаИтерации) И
		(НовоеРасписание.КоличествоПовторов = 0 ИЛИ НовоеРасписание.КоличествоПовторов <> КоличествоПовторов) Цикл
		// Частота заполнения
		Если
			ДниНедели.Найти(ДеньНедели(ДатаИтерации)) <> Неопределено И
			Месяцы.Найти(Месяц(ДатаИтерации)) <> Неопределено И
			((ДатаИтерации - Объект.Дата)/86400) % ПериодПовтораДней = 0 И
			ПроверкаПовтораВДеньМесяца(ДатаИтерации, НовоеРасписание.ДеньВМесяце) И
			ПроверкаПовтораВДеньНеделиВМесяце(ДатаИтерации, НовоеРасписание.ДеньНеделиВМесяце) И
			ПроверкаРазницыВНеделях(ДатаИтерации, ПериодНедель, ПредыдущаяРазницаВНеделях) И
			ПроверкаРазницыВМесяцах(ДатаИтерации, ПериодМесяцев, ПредыдущаяРазницаВМесяцах) И
			ПроверкаРазницыВГодах(ДатаИтерации, ПериодЛет, ПредыдущаяРазницаВГодах)
		Тогда
			
			НовыйПовтор = Объект.ТаблицаПовторов.Добавить();
			НовыйПовтор.ДатаПовтора = ДатаИтерации;
			
			КоличествоПовторов = КоличествоПовторов + 1;
			
		КонецЕсли;
		ДатаИтерации = ДатаИтерации + 86400; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаПовтораВДеньМесяца(ДатаИтерации, ДеньВМесяце)
	//Совпадают ли дата повтора и введеные данные
	Если ДеньВМесяце > 0 Тогда 
		Возврат День(ДатаИтерации) = ДеньВМесяце;	
	ИначеЕсли ДеньВМесяце < 0 Тогда
		Возврат День(ДатаИтерации) = (День(КонецМесяца(ДатаИтерации)) + ДеньВМесяце + 1);
	Иначе
		// Значение не указано
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПроверкаПовтораВДеньНеделиВМесяце(ДатаИтерации, ДеньНеделиВМесяце)	
	Если ДеньНеделиВМесяце > 0 Тогда
		ДеньДоНачалаНедели = (ДеньНеделиВМесяце - 1) * 7;
		ДеньПослеКонцаНедели = ДеньДоНачалаНедели + 8;
		// Последняя неделя месяца не полная
		Если ДеньПослеКонцаНедели - 1 > День(КонецМесяца(ДатаИтерации)) Тогда
			ДеньПослеКонцаНедели = День(КонецМесяца(ДатаИтерации)) + 1;
		КонецЕсли;
	ИначеЕсли ДеньНеделиВМесяце < 0 Тогда
		ДеньПослеКонцаНедели = День(КонецМесяца(ДатаИтерации)) + (ДеньНеделиВМесяце + 1) * 7 + 1;
		ДеньДоНачалаНедели = ДеньПослеКонцаНедели - 8;
		Если ДеньДоНачалаНедели < 0 Тогда
			ДеньДоНачалаНедели = 0;
		КонецЕсли;
	Иначе 
		// Значение не указано
		Возврат Истина;
	КонецЕсли;
	Возврат День(ДатаИтерации) > ДеньДоНачалаНедели И День(ДатаИтерации) < ДеньПослеКонцаНедели;
КонецФункции

&НаКлиенте
Функция ПроверкаРазницыВНеделях(ДатаИтерации, ПериодНедель, ПредыдущаяРазницаВНеделях)
	Результат = Ложь;
	РазницаВНеделях = (НачалоНедели(ДатаИтерации) - НачалоНедели(Объект.Дата))/86400/7;
	Если ПериодНедель = 1 Тогда
		 Результат = Истина;
	ИначеЕсли РазницаВНеделях % ПериодНедель = 0 И ПредыдущаяРазницаВНеделях <> РазницаВНеделях Тогда
		ПредыдущаяРазницаВНеделях = РазницаВНеделях;
		Результат = Истина;	
	КонецЕсли;
	Возврат Результат;
КонецФункции    

&НаКлиенте
Функция ПроверкаРазницыВМесяцах(ДатаИтерации, ПериодМесяцев, ПредыдущаяРазницаВМесяцах)
	Результат = Ложь;
	МесяцНачала = Месяц(Объект.Дата);
	МесяцКонца = Месяц(ДатаИтерации);
	ЛетМеждуДатами = Год(ДатаИтерации) - Год(Объект.Дата);
	РазницаВМесяцах = МесяцКонца - МесяцНачала + ЛетМеждуДатами;
	Если ПериодМесяцев = 1 Тогда
		 Результат = Истина;
	ИначеЕсли РазницаВМесяцах % ПериодМесяцев = 0 И ПредыдущаяРазницаВМесяцах <> РазницаВМесяцах Тогда
		ПредыдущаяРазницаВМесяцах = РазницаВМесяцах;
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПроверкаРазницыВГодах(ДатаИтерации, ПериодЛет, ПредыдущаяРазницаВГодах)
	Результат = Ложь;
	РазницаВГодах = Год(ДатаИтерации) - Год(Объект.Дата);
	Если ПериодЛет = 1 Тогда
		 Результат = Истина;
	ИначеЕсли РазницаВГодах % ПериодЛет = 0 И ПредыдущаяРазницаВГодах <> РазницаВГодах Тогда
		ПредыдущаяРазницаВГодах = РазницаВГодах;
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции  

#КонецОбласти
